# GroupId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GroupId Property
Element Class See Also
---
The id of the group to which an element belongs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId GroupId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GroupId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ GroupId {
	ElementId^ get ();
}
```

# See Also
Element Class
Autodesk.Revit.DB Namespace